{
  "_name_or_path": "cointegrated/rubert-tiny",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "emb_size": 312,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "\u0410\u043a\u0442\u0438\u0432",
    "1": "\u0422\u0435\u0445.\u043d\u0435\u043f\u043e\u043b\u0430\u0434\u043a\u0438",
    "2": "\u041a\u043e\u043d\u0435\u0446 \u0443\u0440\u043e\u043a\u0430",
    "3": "\u041f\u0440\u043e\u0434\u0430\u0436\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0438\u0445 \u0442\u043e\u0432\u0430\u0440\u043e\u0432",
    "4": "\u041d\u0435\u0434\u043e\u0432\u043e\u043b\u044c\u0441\u0442\u0432\u043e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043c\u043e\u0439",
    "5": "\u0412\u043e\u0437\u043c\u043e\u0436\u043d\u0430\u044f \u043e\u0442\u043c\u0435\u043d\u0430 \u0443\u0440\u043e\u043a\u0430",
    "6": "\u041d\u0430\u0447\u0430\u043b\u043e \u0443\u0440\u043e\u043a\u0430",
    "7": "\u041f\u0440\u043e\u0434\u0430\u0436\u0430 \u0441\u0442\u043e\u0440\u043e\u043d\u043d\u0438\u0445 \u0442\u043e\u0432\u0430\u0440\u043e\u0432",
    "8": "\u0427\u0442\u043e-\u0442\u043e \u0438\u043d\u0442\u0435\u0440\u0435\u0441\u043d\u043e\u0435"
  },
  "initializer_range": 0.02,
  "intermediate_size": 600,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.40.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29564
}
